<template>
    <div class="mainText">
        <div>
            Vue.js предоставляет множество функций, которые позволяют создавать повторно
            используемые веб-компоненты. Маршрутизация — одна из таких функций. Она позволяет
            пользователю переключаться между страницами без обновления страницы. Это то,
            что делает навигацию в веб-приложениях простой и очень приятной. Итак, в этой
            статье я объясню, как работают маршрутизаторы Vue.js, создав в качестве примера
            шаблона Vue.js Router.
        </div>
        <div>
            Vue.js предоставляет множество функций, которые позволяют создавать повторно
            используемые веб-компоненты. Маршрутизация — одна из таких функций. Она позволяет
            пользователю переключаться между страницами без обновления страницы. Это то,
            что делает навигацию в веб-приложениях простой и очень приятной. Итак, в этой
            статье я объясню, как работают маршрутизаторы Vue.js, создав в качестве примера
            шаблона Vue.js Router.
        </div>
        <div>
            Vue.js предоставляет множество функций, которые позволяют создавать повторно
            используемые веб-компоненты. Маршрутизация — одна из таких функций. Она позволяет
            пользователю переключаться между страницами без обновления страницы. Это то,
            что делает навигацию в веб-приложениях простой и очень приятной. Итак, в этой
            статье я объясню, как работают маршрутизаторы Vue.js, создав в качестве примера
            шаблона Vue.js Router.
        </div>
    </div>
</template>

<script>
    export default {
        name: "Text"

    }
</script>

<style scoped>
    .mainText {
        padding: 50px;
        text-align: justify;
        font-family: Roboto, serif;
        font-size: 22px;
        color: #E0E0E0;;

    }
</style>